# 3. Trabajando con DataFrames

In [1]:
#Importamos librerias
import pandas as pd
import numpy as np

### Creando DataFrames

In [2]:
d = {'c1': pd.Series(['A', 'B', 'C']),  
     'c2': pd.Series([1, 2., 3., 4.])}  
df = pd.DataFrame(d)  
df

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [3]:
sales = {
   'region': ["Europe", "Europe", "Europe",   
              "USA", "USA", "USA", "LATAM", "LATAM"],  
   'volume':[100, 120, 140, 200, 190, 180, 80, 90],  
   'year':[2011, 2012, 2013, 2011, 2012, 2013, 2012, 2013]  
}  
data = pd.DataFrame(sales)
data

   region  volume  year
0  Europe     100  2011
1  Europe     120  2012
2  Europe     140  2013
3     USA     200  2011
4     USA     190  2012
5     USA     180  2013
6   LATAM      80  2012
7   LATAM      90  2013

In [4]:
data.head()

   region  volume  year
0  Europe     100  2011
1  Europe     120  2012
2  Europe     140  2013
3     USA     200  2011
4     USA     190  2012

In [5]:
data.tail()

  region  volume  year
3    USA     200  2011
4    USA     190  2012
5    USA     180  2013
6  LATAM      80  2012
7  LATAM      90  2013

In [6]:
#elementos de una columna
list(set(data['region']))

['LATAM', 'Europe', 'USA']

In [10]:
array1 = data['region'].unique()
print(array1)

['Europe' 'USA' 'LATAM']

In [11]:
#contar elementos en una columna
data['region'].value_counts()

USA       3
Europe    3
LATAM     2
Name: region, dtype: int64

In [12]:
data['volume']

0    100
1    120
2    140
3    200
4    190
5    180
6     80
7     90
Name: volume, dtype: int64

In [14]:
df2 = data[['volume','year']]
print(df2)

   volume  year
0     100  2011
1     120  2012
2     140  2013
3     200  2011
4     190  2012
5     180  2013
6      80  2012
7      90  2013

In [15]:
data[6::] #selecciona las filas a partir de la sexta

  region  volume  year
6  LATAM      80  2012
7  LATAM      90  2013

In [16]:
data.iloc[5,1] #selecciona el valor de la fila 5 y columna 1 (numeradas empezando en 0  siempre)

180

In [17]:
data.loc[data.region=='Europe']

   region  volume  year
0  Europe     100  2011
1  Europe     120  2012
2  Europe     140  2013

In [18]:
data.loc[data.volume>120]

   region  volume  year
2  Europe     140  2013
3     USA     200  2011
4     USA     190  2012
5     USA     180  2013

## 1. Cargamos csv

In [26]:
#import pandas as pd
url='https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv'  
vinos = pd.read_csv(url,sep=';', encoding='utf-8')
vinos.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [24]:
#import pandas as pd
url='https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv'  
vinos = pd.read_csv(url,sep=';', header=None)
vinos.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1,7.4,0.7,0,1.9,0.076,11,34,0.9978,3.51,0.56,9.4,5
2,7.8,0.88,0,2.6,0.098,25,67,0.9968,3.2,0.68,9.8,5
3,7.8,0.76,0.04,2.3,0.092,15,54,0.997,3.26,0.65,9.8,5
4,11.2,0.28,0.56,1.9,0.075,17,60,0.998,3.16,0.58,9.8,6

In [25]:
# Volver a lanzar la primera celda
vinos.shape

(1600, 12)

In [27]:
# Tipos de datos de las columnas
vinos.dtypes

fixed acidity           float64
volatile acidity        float64
citric acid             float64
residual sugar          float64
chlorides               float64
free sulfur dioxide     float64
total sulfur dioxide    float64
density                 float64
pH                      float64
sulphates               float64
alcohol                 float64
quality                   int64
dtype: object

In [28]:
#importante ver la diferencia de haber importado con y sin cabeceras
vinos.pH.dtype

dtype('float64')

In [29]:
vinos.to_csv('estecsv.csv')

### Operaciones sobre tablas (csv)

In [ ]:
#ordenar una lista  
Sorted = vinos.sort_values(['pH'], ascending=False)
Sorted.head(8)

In [ ]:
#hallar el máximo:
vinos['pH'].max()

In [30]:
vinos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
fixed acidity           1599 non-null float64
volatile acidity        1599 non-null float64
citric acid             1599 non-null float64
residual sugar          1599 non-null float64
chlorides               1599 non-null float64
free sulfur dioxide     1599 non-null float64
total sulfur dioxide    1599 non-null float64
density                 1599 non-null float64
pH                      1599 non-null float64
sulphates               1599 non-null float64
alcohol                 1599 non-null float64
quality                 1599 non-null int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [31]:
data.groupby('region').sum()

        volume  year
region
Europe     360  6036
LATAM      170  4025
USA        570  6036

In [32]:
#agrupamos por año y obtenemos los valores máximos por año
data.groupby('year').max()

     region  volume
year
2011    USA     200
2012    USA     190
2013    USA     180

In [33]:
#convertimos en mayúsculas las entradas de 'region'  
data['region'] = data.region.apply(lambda x: x.upper())
data['region']

0    EUROPE
1    EUROPE
2    EUROPE
3       USA
4       USA
5       USA
6     LATAM
7     LATAM
Name: region, dtype: object

In [34]:
#elevamos al cuadrado los elementos de la columna 'volume'
data['volume'] = data.volume.apply(lambda x:x**2)
data['volume']

0    10000
1    14400
2    19600
3    40000
4    36100
5    32400
6     6400
7     8100
Name: volume, dtype: int64

## Trabajamos indexación sobre un pequeño dataset

In [35]:
# Nuestro pequeño dataset  
d = [0,1,2,3,4,5,6,7,8,9]

In [36]:
# Creamos el dataframe  
df = pd.DataFrame(d)  
df

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [37]:
df.columns = ['Rev']
df

   Rev
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9

In [38]:
#agregamos una nueva columna  
df['NewCol'] = 5  
df

   Rev  NewCol
0    0       5
1    1       5
2    2       5
3    3       5
4    4       5
5    5       5
6    6       5
7    7       5
8    8       5
9    9       5

In [39]:
# podemos modificar la nueva columna  
df['NewCol'] = df['NewCol'] + 1
df

   Rev  NewCol
0    0       6
1    1       6
2    2       6
3    3       6
4    4       6
5    5       6
6    6       6
7    7       6
8    8       6
9    9       6

In [40]:
# borramos la nueva columna  
del df['NewCol']
df

   Rev
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9

# INDEXADORES
Hay que mencionar la diferencia entre los indexadores básicos de las tablas:
- .iloc – Es un indexador basado en enteros estrictamente que busca en la posición sin tener en cuenta .index ni .columns.
- .loc – Es un indexador que localiza las posiciones donde se tienen determinados valores y también puede seleccionar sectores de la tabla que estén entre celdas que cumplan las condiciones.
- .ix – Es un indexador basado en los valores de los índices por filas. (deprecado)
- .iy – Análogo a .ix pero por columnas (deprecado)

In [41]:
#generamos índices en forma de fechas por años  
idx = pd.date_range(start='12/31/2011', periods=10, freq='A')
idx

DatetimeIndex(['2011-12-31', '2012-12-31', '2013-12-31', '2014-12-31',
               '2015-12-31', '2016-12-31', '2017-12-31', '2018-12-31',
               '2019-12-31', '2020-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

### Establecemos los indices en nuestro dataframe

In [42]:
df.index=idx
df

            Rev
2011-12-31    0
2012-12-31    1
2013-12-31    2
2014-12-31    3
2015-12-31    4
2016-12-31    5
2017-12-31    6
2018-12-31    7
2019-12-31    8
2020-12-31    9

In [50]:
df1=df.iloc[:2]
#df2=df.ix[4:]#Esta deprecado mejor usar el siguiente
df2=df.iloc[5:]
print(df1)
print(df2)

            Rev
2011-12-31    0
2012-12-31    1
            Rev
2016-12-31    5
2017-12-31    6
2018-12-31    7
2019-12-31    8
2020-12-31    9

In [44]:
#enlazamos ambos dataframes, por defecto se hace verticalmente  
pd.concat([df1,df2])

            Rev
2011-12-31    0
2012-12-31    1
2016-12-31    5
2017-12-31    6
2018-12-31    7
2019-12-31    8
2020-12-31    9

In [45]:
#creamos una nueva columna y le ponemos el mismo índice que tiene el dataframe df  
df3=pd.DataFrame(np.arange(4,14))  
df3.index=df.index  
df3

             0
2011-12-31   4
2012-12-31   5
2013-12-31   6
2014-12-31   7
2015-12-31   8
2016-12-31   9
2017-12-31  10
2018-12-31  11
2019-12-31  12
2020-12-31  13

In [46]:
#podemos concatenar agregando la columna sólo si tienen el mismo índice  
pd.concat([df,df3],axis=1)

            Rev   0
2011-12-31    0   4
2012-12-31    1   5
2013-12-31    2   6
2014-12-31    3   7
2015-12-31    4   8
2016-12-31    5   9
2017-12-31    6  10
2018-12-31    7  11
2019-12-31    8  12
2020-12-31    9  13

## STACK

In [47]:
#ahora hacemos stack en las columnas  
stacked=data.stack()
stacked

0  region    EUROPE
   volume     10000
   year        2011
1  region    EUROPE
   volume     14400
   year        2012
2  region    EUROPE
   volume     19600
   year        2013
3  region       USA
   volume     40000
   year        2011
4  region       USA
   volume     36100
   year        2012
5  region       USA
   volume     32400
   year        2013
6  region     LATAM
   volume      6400
   year        2012
7  region     LATAM
   volume      8100
   year        2013
dtype: object

## TRASPONER

In [48]:
# Esto transpone la tabla  
data.T

             0       1       2      3      4      5      6      7
region  EUROPE  EUROPE  EUROPE    USA    USA    USA  LATAM  LATAM
volume   10000   14400   19600  40000  36100  32400   6400   8100
year      2011    2012    2013   2011   2012   2013   2012   2013

## GROUPBY

In [ ]:
d = {'one':[1,1,1,1,1],  
     'two':[2,2,2,2,2],  
     'letter':['a','a','b','b','c']}  
# Crear dataframe
sm = pd.DataFrame(d)  
sm

In [ ]:
# agrupamos por letter  
one = sm.groupby('letter')  
# sumamos para cada letra las cantidades en las otras columnas  
one.sum()

In [ ]:
#agrupamos por letter y one y sumamos cuántos hay en cada tipo para two  
sm.groupby(['letter','one']).sum()